modm-ext/data.modm.io/docs/svd/header_stm32h757xx_cm7.svd
        <register>
          <name>ARR</name>
          <description>LPTIM Autoreload register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ARR</name>
              <description>Auto reload register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CNT</name>
          <description>LPTIM Counter register</description>
          <addressOffset>0x1c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CNT</name>
              <description>Counter register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR2</name>
          <description>LPTIM Configuration register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IN1SEL</name>
              <description>IN1SEL[1:0] bits (Remap selection)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO</name>
                  <description>For LPTIM1 and LPTIM2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP1</name>
                  <description>For LPTIM1 and LPTIM2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP2</name>
                  <description>For LPTIM2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP1_COMP2</name>
                  <description>For LPTIM2</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IN2SEL</name>
              <description>IN2SEL[5:4] bits (Remap selection)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO</name>
                  <description>For LPTIM1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP2</name>
                  <description>For LPTIM1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WWDG2</name>
      <description>Window WATCHDOG</description>
      <groupName>WWDG</groupName>
      <baseAddress>0x40002c00</baseAddress>
      <interrupt>
        <name>WWDG</name>
        <description>Window WatchDog Interrupt ( wwdg1_it, wwdg2_it)</description>
        <value>0</value>
      </interrupt>
      <interrupt>
        <name>WWDG_RST</name>
        <description>Window Watchdog reset interrupt (exti_d2_wwdg_it, exti_d1_wwdg_it)</description>
        <value>143</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <description>WWDG Control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>T</name>
              <description>T[6:0] bits (7-Bit counter (MSB to LSB))</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>WDGA</name>
              <description>Activation bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFR</name>
          <description>WWDG Configuration register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>W</name>
              <description>W[6:0] bits (7-bit window value)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>EWI</name>
              <description>Early Wakeup Interrupt</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WDGTB</name>
              <description>WDGTB[2:0] bits (Timer Base)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PRESCALER_1</name>
                  <description>WWDG counter clock = (PCLK1/4096)/1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER_2</name>
                  <description>WWDG counter clock = (PCLK1/4096)/2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER_4</name>
                  <description>WWDG counter clock = (PCLK1/4096)/4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER_8</name>
                  <description>WWDG counter clock = (PCLK1/4096)/8</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER_16</name>
                  <description>WWDG counter clock = (PCLK1/4096)/16</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER_32</name>
                  <description>WWDG counter clock = (PCLK1/4096)/32</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER_64</name>
                  <description>WWDG counter clock = (PCLK1/4096)/64</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER_128</name>
                  <description>WWDG counter clock = (PCLK1/4096)/128</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>WWDG Status register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EWIF</name>
              <description>Early Wakeup Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
